{
  "basics": {
    "name": "Tautvydas Misiunas",
    "email": "tautvydas.misiunas@gmail.com",
    "phone": "+447585234606",
    "profiles": [
      {
        "network": "LinkedIn",
        "username": "Tautvydas Misiunas",
        "url": "https://www.linkedin.com/pub/tautvydas-misiunas/26/b62/745"
      },
      {
        "network": "Stackoverflow",
        "username": "Tautvydas",
        "url": "http://stackoverflow.com/users/951894/tautvydas"
      }
      ],
      "extra": [
        {
          "network": "Github",
          "username": "Tautvis",
          "url": "https://github.com/Tautvis"
        }
      ]
  },
  "work": [
    {
      "company": "Amazon",
      "position": "Software development engineer",
      "type": "Engineering",
      "location": {
        "city": "Edinburgh",
        "country": "UK"
      },
      "startDate": "2014-10",
      "endDate": "present",
      "summary": "Focused on the backend work of massive scale projects. To ensure service scaling and high performance standards under heavy load, I developed a flexible testing framework. As a result, the services performed as predicted during Black Friday and Cyber Monday. I also prototyped machine learning models for content optimisation on Amazon gateway, dynamical filtering of adult content and language inference based on book snippets. Customer impact of major updates was rigorously evaluated with A/B testing, allowing to iterate over ideas fast and backup analysis with numbers. For example, a new widget that I worked on proved to generate $11M worldwide.",
      "keywords": [
        "Java",
        "Python",
        "ML"
      ]
    },
    {
      "company": "Ocado",
      "position": "Software developer",
      "type": "Engineering",
      "location": {
        "city": "London",
        "country": "UK"
      },
      "startDate": "2012-11",
      "endDate": "2013-08",
      "summary": "Having strong mathematical skills I joined the MHE control team at Ocado, providing reliable real-time Java application responsible for control over sixty interconnected cranes and conveyors and communicating with Oracle database as well as other services. For example, I developed a monitoring optimisation module that detects idle machines and optimises item distribution among them. In order to make the module compliant with tight constraints of a real-time application I improved the routing algorithm of the continuously changing warehouse hundred fold. This level of performance jump was achieved by extracting a super-graph with a graph clusterring algorithm (Markov Cluster Algorithm).",
      "keywords": [
        "Java",
        "Python",
        "Oracle"
      ]
    },
    {
      "company": "Center for Physical Sciences and Technology",
      "position": "Research assistant",
      "type": "Research",
      "location": {
        "city": "Vilnius",
        "country": "LT"
      },
      "startDate": "2010-09",
      "endDate": "2011-06",
      "summary": "Under the supervision of Prof. E. Tornau, I developed computational model to explain and predict the behaviour of triangular-shaped molecules. We have extended existing phase models, such as Potts, Blume-Emery-Griffits, to support molecule's ability to settle down on the lattice. The model successfully explained two structures which were observed in experiments and predicted a new structure.",
      "keywords": [
        "Java",
        "Modelling"
      ]
    }
  ],

  "education": [
    {
      "institution": "The University of Edinburgh",
      "location": {
        "city": "Edinburgh",
        "country": "UK"
      },
      "area": "Artificial Intelligence",
      "studyType": "Masters",
      "distinction": " with distinction",
      "startDate": "2013",
      "endDate": "2014",
      "gpa": "75%",
      "summary": "Emphasis on data analysis, machine learning modelling and model analysis."
    },
    {
      "institution": "Vilnius University",
      "location": {
        "city": "Vilnius",
        "country": "LT"
      },
      "area": "Physics",
      "studyType": "BSc",
      "distinction": "",
      "startDate": "2008",
      "endDate": "2012",
      "gpa": "84%",
      "summary": "Strong focus on mathematics, theoretical physics and modelling."
    }
  ],

  "publications": [
    {
      "name": "Ordered assemblies of triangular-shaped molecules with strongly interacting vertices: phase diagrams for honeycomb and zigzag structures on triangular lattice",
      "publisher": "The journal of physical chemistry. B",
      "releaseDate": "2012-03",
      "website": "http://www.ncbi.nlm.nih.gov/pubmed/22224676",
      "summary": "Numerical model for ordering of triangular-shaped molecules with strongly interacting vertices is proposed and solved by the Monte Carlo method."
    }
  ],

  "projects": [
    {
      "name": "Android games",
      "type": "Mobile app",
      "startDate": "2012-07",
      "endDate": "present",
      "summary": "I co-created two Android games that are free to download. Over the years I have been keeping the applications up to date with new releases and support for new Android versions. Both applications are very successful with over 800k downloads.",
      "keywords": [
        "Java",
        "Android",
        "Mobile"
      ]
    },
    {
      "name": "Short term movements in stock prices",
      "type": "Kaggle",
      "startDate": "2014-03",
      "summary": "I participated in Kaggle challenge to predict short term movements in stock prices. The project was meant to improve high-frequency traders. Implemented Hidden Markov Model in order to encapsulate time series behaviour, however simpler logistic regression model proved to be more accurate due to high level of noise. The biggest precision and recall gains were achieved by data preprocessing and feature engineering.",
      "keywords": [
        "Python",
        "ML",
        "Modelling"
      ]
    }
  ]

}
